"""Реализовать функцию, которая находит минимальный и
максимальный элементы в матрице (матрица M x N). Вывести в
консоль индексы найденных элементов"""

a = [
    [17, 13, 11, 17, 10],
    [14, 14, 20, 12, 17],
    [18, 17, 19, 18, 18],
    [16, 18, 17, 15, 15],
    [13, 15, 19, 15, 19]
]


def max_and_min_for_a():
    a_min = (min(min(row) for row in a))
    a_max = (max(max(row) for row in a))

    for i in range(len(a)):
        for j in range(len(a[i])):
            if a[i][j] == a_min:
                print(f"минимально число {a_min} находиться в {i + 1} строке и в {j + 1} столбце")
            if a[i][j] == a_max:
                print(f"максимальное число {a_max} находиться в {i + 1} строке и в {j + 1} столбце")

    print(a_max, a_min)


max_and_min_for_a()